In [3]:
import sqlite3
db = sqlite3.connect("company_database.db")
c = db.cursor()

In [4]:
c.execute('CREATE TABLE company1(ID int, Name text, Age int, Address text, Salary real)')

In [5]:
c.execute("INSERT INTO company1 VALUES (1, 'Jhon', 32, 'Bangalore', 100000.00)")

In [6]:
c.execute("INSERT INTO company1 VALUES (2, 'Jhon', 32, 'Bangalore', 100000.00)")

In [8]:
data=c.execute("SELECT * FROM company1")
data

In [10]:
for i in data:
    print(i)

(1, 'Jhon', 32, 'Bangalore', 100000.0)
(2, 'Jhon', 32, 'Bangalore', 100000.0)

In [12]:
c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (3, 'Venkat', 42, 'Chennai', 400000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (4, 'Raju', 31, 'Madurai', 400000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (5, 'Ankit', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (6, 'Ravi', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company1 (ID, Name, Age, Address, Salary) VALUES (7, 'Shivam', 25, 'Bangalore', 800000.00)")

In [14]:
data=c.execute("SELECT * FROM company1")
for i in data:
    print(i)

(1, 'Jhon', 32, 'Bangalore', 100000.0)
(2, 'Jhon', 32, 'Bangalore', 100000.0)
(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)
(5, 'Ankit', 25, 'Bangalore', 800000.0)
(6, 'Ravi', 25, 'Bangalore', 800000.0)
(7, 'Shivam', 25, 'Bangalore', 800000.0)

In [15]:
db.commit()

In [16]:
db.close()

In [17]:
db = sqlite3.connect("company_database.db")
c=db.cursor()

In [20]:
data=c.execute("select * from company1 where Salary >100000")
for x in data:
    print(x)

(3, 'Venkat', 42, 'Chennai', 400000.0)
(4, 'Raju', 31, 'Madurai', 400000.0)
(5, 'Ankit', 25, 'Bangalore', 800000.0)
(6, 'Ravi', 25, 'Bangalore', 800000.0)
(7, 'Shivam', 25, 'Bangalore', 800000.0)

In [22]:
data=c.execute("select Name from company1 where Address = 'Bangalore'")
for x in data:
    print(x)

('Jhon',)
('Jhon',)
('Ankit',)
('Ravi',)
('Shivam',)